# In Emacs org-mode: before exporting, comment this out START
;; Local Variables:
;; ispell-check-comments: exclusive
;; ispell-local-dictionary: "english"
;; End:
# In Emacs org-mode: before exporting, comment this out FINISH

# Org-mode Export LaTeX Customization Notes:
# - Interpret 'bla_bla' as LaTeX Math bla subscript bla: #+OPTIONS ^:t. Interpret literally bla_bla: ^:nil.
# - org export: turn off heading -> section numbering: #+OPTIONS: num:nil
# - org export: change list numbering to alphabetical, sources:
#   - https://orgmode.org/manual/Plain-lists-in-LaTeX-export.html
#   - https://tex.stackexchange.com/a/129960
#   - must be inserted before each list:
#     #+ATTR_LATEX: :environment enumerate
#     #+ATTR_LATEX: :options [label=\alph*)]
# - allow org to recognize alphabetical lists a)...: M-x customize-variable org-list-allow-alphabetical


# -----------------------
# General Export Options:
#+OPTIONS: ^:nil ':nil *:t -:t ::t <:t H:3 \n:nil arch:headline 
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t todo:t |:t

#+OPTIONS: author:nil
#+OPTIONS: num:t
# t or nil: disable export latex section numbering for org headings
#+OPTIONS: toc:t
# t or nil: no table of contents (doesn't work if num:nil)

#+TITLE: SiSc MachineLearning Notes
#+DATE: <2019-10-12 Sat>
#+AUTHOR: Johannes Wasmer
# #+EMAIL: johannes.wasmer@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.2.2 (Org mode 9.1.13)

# ---------------------
# LaTeX Export Options:
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage[top=0.5in,bottom=0.5in,left=1in,right=1in,includeheadfoot]{geometry} % wider page; load BEFORE fancyhdr
#+LATEX_HEADER: \usepackage[inline]{enumitem} % for customization of itemize, enumerate envs
#+LATEX_HEADER: \usepackage{color}
* 19W Time Schedule

|                                                           | ~#pages |
|-----------------------------------------------------------+---------|
| Lecture 1: Intro                                          |      61 |
| Lecture 2: Probability Density Estimation I               |      54 |
| Lecture 3: Probability Density Estimation II              |      56 |
| Lecture 4: Probability Density Estimation III             |      43 |
| Exercise 1: Python Tutorial, Probability Density, GMM, EM |      30 |
| Lecture 5: Linear Discriminants I                         |      62 |
| Lecture 6: Linear Discriminants II                        |      34 |
| Lecture 7: Linear Discriminants III                       |      52 |
| Lecture 8: SVMs                                           |      63 |
| Lecture 9: SVMs II                                        |      42 |
| Exercise 2: Linear Discriminants, SVM                     |      34 |
| Lecture 10: AdaBoost                                      |      44 |
| Lecture 11: Random Forests                                |      57 |
| Exercise 3: AdaBoost                                      |      12 |
| Lecture 12: Neural Networks I                             |      63 |
| Lecture 13: Neural Networks II                            |      64 |
| Lecture 14: Optimization                                  |      71 |
| Exercise 4: Backprop, Softmax                             |      36 |
| Lecture 15: CNNs I                                        |      52 |
| Lecture 16: CNNs II                                       |      82 |
| Lecture 17: CNNs III                                      |      63 |
| Exercise 5: CNN                                           |     100 |
| Lecture 18: Word Embeddings                               |      37 |
| Lecture 19: RNNs I                                        |      50 |
| Lecture 20: RNNs II                                       |      47 |
| Exercise 6: RNN                                           |      30 |
| Lecture 21: Wrap-up                                       |      48 |
| Lecture 22: Wrap-up II                                    |      14 |
| Lecture 23: Repetition                                    |     134 |
| Tensorflow Tutorial                                       |       8 |
|-----------------------------------------------------------+---------|
|                                                           |    1543 |
#+TBLFM: @2$2=62-1::@3$2=116-62::@4$2=172-116::@5$2=215-172::@7$2=277-215::@8$2=311-277::@9$2=363-311::@10$2=426-363::@11$2=468-426::@13$2=512-468::@14$2=569-512::@16$2=632-569::@17$2=696-632::@18$2=767-696::@20$2=819-767::@21$2=901-819::@22$2=964-901::@24$2=1001-964::@25$2=1051-1001::@26$2=1098-1051::@28$2=1146-1098::@29$2=1160-1146::@30$2=1294-1160::@6$2=31-1::@12$2=65-31::@15$2=70-58::@19$2=106-70::@31$2=105-97::@32$2=vsum(@2..@-1)

pages statistics: 30 events, sum 1500 pages, average/events: 50.
